Autodesk.Revit.UI.FileOpenDialog.#ctor(System.String)
Constructs a new instance of a File Open dialog.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017